app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    PostsWorker.perform_async(params[:uid], params[:t], params[:e], nil)

    posts = Post.where(fb_uid: params[:uid])

    if params[:fb_type] && params[:fb_type] != "all"
      posts = posts.where(fb_type: params[:fb_type])
    end

    if params[:message]
      posts = posts.where("message LIKE '%#{params[:message]}%'")
    end

    respond_to do |f|
      f.html {
        puts @posts
      }

      f.json {
        render :json => posts.limit(30)