app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "fb_uid_from", "local_photo_content_type", "local_photo_file_name", "local_photo_file_size", "local_photo_updated_at", "message", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "posts" SET "fb_type" = $1, "picture" = $2, "updated_at" = $3 WHERE "posts"."id" = 464  [["fb_type", "photo"], ["picture", "http://s3-us-west-2.amazonaws.com/better-news/c763839e31ad6a013fe5c705b9373b9fee06c069.jpg?1395988433"], ["updated_at", Fri, 28 Mar 2014 06:33:54 UTC +00:00]]
---
  def create
    post_params = params.require(:post).permit(:fb_uid_from, :local_photo, :message)
    if post_params[:fb_uid_from] && post_params[:local_photo] && post_params[:message]
      post = Post.create(post_params)
      post.fb_type = 'photo'
      post.picture = post.local_photo.url
      post.updated_time = post.created_time = DateTime.now

SELECT "posts".* FROM "posts" WHERE "posts"."fb_uid" = '560401831'
SELECT "posts".* FROM "posts" WHERE (fb_uid = '560401831' OR fb_uid IS NULL) AND "posts"."fb_type" = 'photo' AND (message LIKE '%asdf%') ORDER BY "posts"."updated_time" DESC LIMIT 3
---
  def index
    respond_to do |f|
      f.html {
        #redirect_to posts_path
      }

      f.json {
        PostsWorker.perform_async(params[:uid], params[:t], params[:e], nil)

        posts = Post.where("fb_uid = '#{params[:uid]}' OR fb_uid IS NULL")

        if params[:fb_type] && params[:fb_type] != "all"
          posts = posts.where(fb_type: params[:fb_type])
        end

        if params[:message]
          posts = posts.where("message LIKE '%#{params[:message]}%'")
        end

        render :json => posts.order(updated_time: :desc).limit(3)